scmv6/center-task1/src/main/resources/soapargs.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:ws="http://ws.server.iris.com">
  <soapenv:Header />
  <soapenv:Body>
    <ws:searchPsnList>
      <!--Optional: -->
      <arg0>5444</arg0>
      <!--Optional: -->
      <arg1>?</arg1>
      <!--Optional: -->
      <arg2>?</arg2>
    </ws:searchPsnList>
  </soapenv:Body>
</soapenv:Envelope>